# Assignment Pandas (Loc and Iloc)

In [8]:
import pandas as pd

In [40]:
# Creating the dataset 
data = {
    'Name':['Alice','Bob','Charlie','David','Eva','Frank','John','Grace'],
    'Age':[24,30,35,40,22,18,28,33],
    'City':['New York','london','Berlin','Paris','London','New York','Berlin','Paris'],
    'Score':[85,90,95,88,76,65,78,91]
}

In [41]:
#  convert the data to dataframe
df = pd.DataFrame(data)

# Display the DataFrame
print(df)

      Name  Age      City  Score
0    Alice   24  New York     85
1      Bob   30    london     90
2  Charlie   35    Berlin     95
3    David   40     Paris     88
4      Eva   22    London     76
5    Frank   18  New York     65
6     John   28    Berlin     78
7    Grace   33     Paris     91

Q1. You have a DataFrame df with columns['Name','Age','City']. Select the row where the Name is 'John'? 
         # note : 'John' name not avilable

In [56]:
df.loc[6:6]

   Name  Age    City  Score
6  John   28  Berlin     78

In [55]:
j = df[df['Name']== 'John'][['Name','Age','City']]
print(j)

   Name  Age    City
6  John   28  Berlin

Q2. From the same DataFrame,select the 5th row(indrex 4)?

In [58]:
df.loc[4]

Name        Eva
Age          22
City     London
Score        76
Name: 4, dtype: object

Q3. Select rows with indices 2 to 4 and only the Age and City columns using loc? Perform the same operation with iloc?

In [64]:
# loc

a = df.loc[2:4,['Age','City']]
a

   Age    City
2   35  Berlin
3   40   Paris
4   22  London

In [69]:
# iloc

b = df.iloc[2:5,[1,2]]
b

   Age    City
2   35  Berlin
3   40   Paris
4   22  London

Q4. Select all rows where Age is greter than 25 using loc?

In [70]:
w = df.loc[df['Age'] > 25]
w

      Name  Age    City  Score
1      Bob   30  london     90
2  Charlie   35  Berlin     95
3    David   40   Paris     88
6     John   28  Berlin     78
7    Grace   33   Paris     91

Q5. Update City to 'New York' for all rows where the Age is less than 20 using loc.

In [74]:
df.loc[df['Age']<20,'City'] = 'New York'
df

      Name  Age      City  Score
0    Alice   24  New York     85
1      Bob   30    london     90
2  Charlie   35    Berlin     95
3    David   40     Paris     88
4      Eva   22    London     76
5    Frank   18  New York     65
6     John   28    Berlin     78
7    Grace   33     Paris     91

Q6. Select the first three rows and the first two columns using iloc?

In [76]:
h = df.iloc[:3,:2]
h

      Name  Age
0    Alice   24
1      Bob   30
2  Charlie   35

Q7. Set the Age to 30 for rows with indices 1 and 3 using iloc?

In [79]:
df.iloc[[1,3],1] = 30
df

      Name  Age      City  Score
0    Alice   24  New York     85
1      Bob   30    london     90
2  Charlie   35    Berlin     95
3    David   30     Paris     88
4      Eva   22    London     76
5    Frank   18  New York     65
6     John   28    Berlin     78
7    Grace   33     Paris     91

Q8. Select all rows where City is either 'London' or 'Paris' using loc?

In [86]:
# ?

df.loc[df['City'].isin(['london','Paris'])]

    Name  Age    City  Score
1    Bob   30  london     90
3  David   30   Paris     88
7  Grace   33   Paris     91

Q9. Select the value at row index 3 and column index 1?

In [92]:
d = df.iloc[3,1]
print(d)

30

Q10. Using loc, filter the rows where City is 'Berlin',and then use iloc to select the first three rows of the filtered result?

In [95]:
filter_city_Berlin = df.loc[df['City'] == 'Berlin']
x = filter_city_Berlin.iloc[:3]
x

      Name  Age    City  Score
2  Charlie   35  Berlin     95
6     John   28  Berlin     78

Q11. Update the Score of Charlie to 98 using .loc?

In [102]:
df.loc[df['Name'] == 'Charlie','Score'] = 98
df

      Name  Age      City  Score
0    Alice   24  New York     85
1      Bob   30    london     90
2  Charlie   35    Berlin     98
3    David   30     Paris     88
4      Eva   22    London     76
5    Frank   18  New York     65
6     John   28    Berlin     78
7    Grace   33     Paris     91

Q12. Access the Age of the 6th row using .iloc?

In [104]:
df.iloc[5,1]

np.int64(18)

Q13. Select all rows where Age is greater than 25 and City is 'Berlin'?

In [105]:
df.loc[(df['Age']>25) & (df['City'] == 'Berlin')]

      Name  Age    City  Score
2  Charlie   35  Berlin     98
6     John   28  Berlin     78

Q14. Select only the Name and Score columns for the first five rows using ,iloc?

In [106]:
df.iloc[:5,[0,3]]

      Name  Score
0    Alice     85
1      Bob     90
2  Charlie     98
3    David     88
4      Eva     76

Q15.Select rows with indices from 3 to 6 (inclusive) and all columns using .iloc?

In [107]:
df.iloc[3:7]

    Name  Age      City  Score
3  David   30     Paris     88
4    Eva   22    London     76
5  Frank   18  New York     65
6   John   28    Berlin     78